user_agreement = """
1. Определения
1.1. Система — программное обеспечение, разработанное Компанией, предоставляющее доступ к корпоративным ресурсам и сервисам.
1.2. Пользователь — физическое лицо, прошедшее регистрацию в Системе и использующее его функциональные возможности.
1.3. Персональные данные — это любая информация, относящаяся к идентифицированному физическому лицу или физическому лицу, которое может быть идентифицировано.
1.4. Биометрические персональные данные — это информация, характеризующая физиологические и биологические особенности человека, которая используется для его уникальной идентификации (отпечатки пальцев рук, ладоней, радужная оболочка глаза, характеристики лица и его изображение и другое)
1.5. Данные устройства — информация, собираемая автоматически при использовании Системы, включая IP-адрес, MAC-адрес, данные местоположения Пользователя.

2. Принятие условий Соглашения
(1) Используя Систему, Пользователь подтверждает, что прочитал и полностью согласен с условиями настоящего Соглашения.
(2) Если Пользователь не согласен с условиями, он обязан немедленно прекратить использование Системы.

3. Регистрация
(1) Для доступа к Системе требуется регистрация Пользователя, включающая создание уникального логина и пароля.
(2) В процессе регистрации Пользователь должен предоставить свои биометрические персональные данные (изображение лица).
(3) Пользователь несет ответственность за сохранность своих учетных данных и обязуется не передавать их третьим лицам.

4. Сбор и обработка персональных данных
(1) Компания собирает и обрабатывает персональные данные Пользователя в соответствии с Законом Республики Беларусь от 7 мая 2021 г. № 99-З «О защите персональных данных».
(2) Сбор данных осуществляется для следующих целей:
    (1) Идентификация и аутентификация Пользователя;
    (2) Управление доступом к корпоративным ресурсам;
    (3) Улучшение функциональных возможностей Системы и аналитики;
    (4) Обеспечение безопасности и предотвращение мошенничества.
(3) В дополнение к данным, указанным при регистрации, Система может автоматически собирать:
    (1) IP-адрес устройства;
    (2) MAC-адрес и уникальные идентификаторы устройств Пользователя.

5. Биометрические данные
(1) Компания может использовать биометрические персональные данные для аутентификации Пользователя и защиты его учетных данных.
(2) Биометрические персональные данные обрабатываются исключительно с целью обеспечения информационной безопасности и не передаются третьим лицам без согласия Пользователя.
(3) Пользователь может в любой момент отозвать своё согласие на обработку биометрических персональных данных, однако это может ограничить доступ к функционалу Приложения.

6. Хранение данных
(1) Все персональные данные хранятся на защищённых серверах Компании и шифруются с использованием алгоритма RSA в целях обеспечения конфиденциальности.
(2) Компания сохраняет данные Пользователя в течение срока действия его учетной записи и до двух дней после ее удаления.

7. Права и обязанности сторон
(1) Права Компании:
    (1) Вносить изменения в Систему без предварительного уведомления Пользователей.
    (2) Осуществлять мониторинг активности Пользователей.
    (3) Приостанавливать или прекращать доступ к Системе в случае нарушения Пользователем условий Соглашения.

(2) Обязанности Компании:
    (1) Компания предпринимает все разумные меры для защиты данных Пользователя от несанкционированного доступа, утраты и (или) уничтожения.

(3) Права Пользователя:
    (1) Запрашивать доступ к своим персональным данным, их исправление или удаление.
    (2) Отказаться от использования Системы и удалить свои данные, связавшись с Компанией.

(4) Обязанности Пользователя:
    (1) Соблюдать условия настоящего Соглашения.
    (2) Не использовать Систему для противоправных действий и передачи ложной информации.
    (3) Не передавать корпоративные данные третьим лицам.

(5) Обязанности Администратора Компании:
    (1) Администратор несет юридическую и материальную ответственность за сотрудников Компании.
    (2) Администратор обязуется не распространять и не передавать третьим лицам любую корпоративную информацию, включая пользовательские данные сотрудников Компании, ключи шифрования и т.д.

8. Ограничение ответственности
(1) Компания не несёт ответственности за убытки, возникшие у Пользователя вследствие использования Системы, включая утрату данных, если они произошли по вине Пользователя.
(2) Компания не гарантирует бесперебойную работу Системы и не несет ответственности за технические сбои, вызванные обстоятельствами, находящимися вне её контроля.

9. Изменение условий Соглашения
(1) Компания оставляет за собой право изменять настоящее Соглашение в любое время. Об изменениях Пользователи будут уведомлены посредством электронной почты.
(2) Продолжение использования Системы после внесения изменений считается согласием Пользователя с обновлёнными условиями.

10. Контактная информация
Вопросы по поводу настоящего Соглашения или обработки ваших данных необходимо направлять на электронную почту SoloCompanyEntertaiment@gmail.com

11. Заключительные положения
(1) Настоящее Соглашение регулируется законодательством Республики Беларусь.
(2) Все споры подлежат разрешению посредством переговоров (переписке по E-mail), в случае не достижения соглашения посредством переговоров (переписке по E-mail) – спор передается для рассмотрения в Суд по месту нахождения Компании.
"""
